'''
Задача 368
Кемпнер-подобные ряды


Хорошо известно, что гармонический ряд  1
+
1
2


+

1
3


+

1
4


+ ... расходится. 


Однако, если мы исключим из этого ряда все члены, в которых знаменатель содержит цифру 9, этот ряд удивительным образом сойдется к примерно 22.9206766193.

Этот измененный гармонический ряд называется рядом Кемпнера.


Рассмотрим другой гармонический ряд, измененный путем исключения всех членов, в которых знаменатель содержит 3 или более одинаковых цифры подряд. Возможно убедиться, что из первых 1200 членов гармонического ряда только 20 членов будут исключены таким образом.
Этими 20 исключенными членами являются:




1
111


,

1
222


,

1
333


,

1
444


,

1
555


,

1
666


,

1
777


,

1
888


,

1
999


,

1
1000


,

1
1110


,





1
1111


,

1
1112


,

1
1113


,

1
1114


,

1
1115


,

1
1116


,

1
1117


,

1
1118


 и 

1
1119


.



Полученный ряд тоже сходится.

 
Найдите значение, к которому сходится такой ряд.

Дайте ответ, округленный до 10 цифр после десятичной точки.

 Оригинал
'''