'''
Задача 236
Подарочная корзинка

Поставщики 'A' и 'B' предоставили следующее количество товаров для рынка подарочных корзинок:

Товар'A''B'
Белужья икра5248640
Рождественский пирог13121888
Ветчина26243776
Старый портвейн57603776
Шампаньские трюфели39365664

Несмотря на то, что поставщики очень стараются доставить свой товар в идеальном состоянии, неотвратимо происходит порча товара - т.е. продукты портятся.
Поставщики сравнивают свои услуги, используя два вида статистики:
Пять степеней порчи каждого продукта в отдельности у обоих поставщиков равны количеству испортившихся продуктов, деленому на общее количество поставленных продуктов, для каждого из пяти товаров по отдельности.
Общая степень порчи для каждого поставщика равна общему количеству испортившихся продуктов, деленому на общее количество продуктов, поставленных этим поставщиком.
К своему удивлению, поставщики обнаружили, что каждая из пяти степеней порчи для каждого продукта у поставщика 'B' оказалась выше (хуже), чем у 'A', с одинаковым коэффициентом (отношение степеней порчи), m>1. Тем не менее, как это ни парадоксально, но общая степень порчи у 'A' была хуже, чем у 'B', причем тоже с коэффициентом m.
Существует тридцать пять m>1, при которых возникает этот удивительный результат, наименьшее из которых равно 1476/1475.
Каково наибольшее возможное значение m?

Дайте ответ в виде простой дроби u/v.
 Оригинал
'''