'''
Задача 261
Суммы квадратов-опор

Назовем целое положительное число k квадратом-опорой, если существует такая пара целых чисел m > 0 и n ≥ k, что сумма (m+1) последовательных квадратов до k (включительно) равнялась сумме m последовательных квадратов от (n+1):

(k-m)2 + ... + k2 = (n+1)2 + ... + (n+m)2.
Некоторые малые значения квдратов-опор:
4: 32 + 42
 = 52
21: 202 + 212 = 292
24: 212 + 222 + 232 + 242 = 252 + 262 + 272
110: 1082 + 1092 + 1102 = 1332 + 1342
Найдите сумму всех различных квадратов-опор ≤ 1010.
 Оригинал
'''