'''
Задача 681
Максимальная площадь


Для данных натуральных чисел $a \le b \le c \le d$ может быть возможно образовать четырехугольники с длинами сторон $a,b,c,d$ (в любом порядке). Когда это так, пусть $M(a,b,c,d)$ обозначает максимальную площадь такого четырехугольника. 
Например, $M(2,2,3,3)=6$, полученная, например, прямоугольником $2\times 3$.


Пусть $SP(n)$ будет суммой $a+b+c+d$ для всех выбранных $a \le b \le c \le d$, для которых $M(a,b,c,d)$ является натуральным числом не больше $n$.
$SP(10)=186$ и $SP(100)=23238$.


Найдите $SP(1\,000\,000)$.

 Оригинал
'''