'''
Задача 263
Сбылась мечта инженера

Рассмотрим число 6. Делителями 6 являются 1,2,3 и 6.
Каждое число от 1 до 6 (включительно) может быть записано в виде суммы различных делителей 6:
1=1, 2=2, 3=1+2, 4=1+3, 5=2+3, 6=6.
Число n называется практичным, если каждое из чисел от 1 до n включительно может быть записано в виде суммы различных делителей n.


Пара последовательных простых чисел разницей в 6, называется секси-парой (поскольку "sex" - латинское слово, обозначающее "шесть"). Первая секси-пара (23, 29).


Иногда удается найти тройную пару чисел. Это означает, что встречаются три последовательные секси-пары, у которых второй член пары одновременно является первым членом следующей пары.


Число n, удовлетворяющее следующим требованиям:

(n-9, n-3), (n-3,n+3), (n+3, n+9) образуют тройную пару, и
все числа n-8, n-4, n, n+4 и n+8 являются практичными,

будем называть раем инженера.

Найдите сумму первых четырех раев инженера.

 Оригинал
'''