'''
Задача 1
Числа, кратные 3 или 5

Если выписать все натуральные числа меньше 10, кратные 3 или 5, то получим 3, 5, 6 и 9. Сумма этих чисел равна 23.

Найдите сумму всех чисел меньше 1000, кратных 3 или 5.
'''



in_put = 1000
rs = []
for i in range(3, in_put, 3):
    rs.append(i)

for i in range(5, in_put, 5):
    rs.append(i)



print('[#] -----------------------------TASK1-----------------------------')
print('[!] input: 1000')
print('[+] -----------------------------RESULT-----------------------------')
print(rs)
print('[+] ------------------------------SUM-------------------------------')
print(sum(rs))
print('[=] -----------------------------FINISH-----------------------------')

