'''
Задача 148
Исследуем треугольник Паскаля

Можно легко показать, что ни один из элементов в первых семи рядах треугольника Паскаля не делится на 7:


 
 
 
 
 
 
 1


 
 
 
 
 
 1
 
 1


 
 
 
 
 1
 
 2
 
 1


 
 
 
 1
 
 3
 
 3
 
 1


 
 
 1
 
 4
 
 6
 
 4
 
 1


 
 1
 
 5
 
10
 
10
 
 5
 
 1


1
 
 6
 
15
 
20
 
15
 
 6
 
 1


Однако, если мы проверим первые сто рядов, то обнаружим, что только 2361 из 5050 элементов не делятся на 7.
Найдите количество элементов, которые не делятся на 7, в первом миллиарде (109) рядов треугольника Паскаля.
 Оригинал
'''