'''
Задача 796
Большая перетасовка

Стандартная колода из $52$ карт содержит карты тринадцати достоинств четырех мастей. Однако, современные колоды также содержат двух джокеров, у которых нет ни достоинства, ни масти, что увеличивает размер колоды до $54$ карт. Если такую колоду перетасовать и брать по одной карте без повторений, тогда в среднем нам понадобится взять примерно $29.05361725$ карт для того, чтобы получить хотя бы одну карту каждого достоинства.
Теперь предположим, что у вас есть $10$ таких колод с различными рубашками. Перетасуем все $10 \times 54$ карт вместе и будем брать карты без повторений. Каково ожидаемое количество карт необходимо взять, чтобы получить хотя бы одну карту каждого достоинства, масти и рубашки?
Приведите ваш ответ округленным до 8 знаков после десятичной точки.
 Оригинал
'''