'''
Задача 818
SET


Карточная игра SET® использует колоду с $81$ различной картой. У каждой карты есть четыре характеристики (форма, цвет, количество, заливка). Каждая характеристика представлена в трех различных вариациях (например, цвет может быть красным, фиолетовым или зеленым).

SET состоит из трех различных карт, на которых каждая характеристика или одинакова, или же различается между всеми тремя картами.

Для набора $C_n$ из $n$ карт пусть $S(C_n)$ обозначает количество SET-ов в $C_n$. Тогда определим $F(n) = \sum\limits_{C_n} S(C_n)^4$, где $C_n$ проходит по всем возможным наборам из $n$ карт (из $81$ доступной карты).
Известно, что $F(3) = 1080$ и $F(6) = 159690960$.

Найдите $F(12)$.

$\scriptsize{\text{SET является зарегистрированным товарным знаком Cannei, LLC.  Все права защищены.  
Используется с разрешения PlayMonster, LLC.}}$
 Оригинал
'''