'''
Задача 808
Обратимые квадраты простых чисел


Оба числа 169 и 961 являются квадратами простого числа. 169, записанное справа налево, дает 961.


Назовем число обратимым квадратом простого числа, если:

Оно не является палиндромом и
Оно является квадратом простого числа и
Записанное справа налево оно дает также квадрат простого числа.


169 и 961 не являются палиндромами, поэтому оба являются обратимыми квадратами простых чисел.


Найдите сумму первых 50 обратимых квадратов простых чисел.

 Оригинал
'''