'''
Задача 667
Перемещение пятиугольника


После покупки дивана Гервер в компании "Движущиеся диваны", Джек хочет купить подходящий по стилю кофейный столик той же компании. Самое важное для него - чтобы столик можно было протолкнуть в гостиную через Г-образный коридор его квартиры, не отрывая ножек столика от пола.
К сожалению, простая квадратная модель столика, которую ему предложили, для него слишком мала, поэтому он попросил столик побольше.
Ему предложили новую пятиугольную модель, изображенную ниже:


Заметим, что, хоть форму и размер столика можно заказать индивидуально, ввиду производственных ограничений все стороны пятиугольного стола должны быть одинаковой длины.

При оптимальной форме и размере, какой наибольший (по площади) пятиугольный кофейный столик Джек может заказать, так чтобы он все еще влезал в его Г-образный коридор единичной ширины?

Дайте ваш ответ округленным до 10 цифры после десятичной точки (если бы Джек выбрал квадратную модель вместо пятиугольной, ответ был бы равен 1.0000000000).
 Оригинал
'''