'''
Задача 770
Дельфийский кувырок


A и B играют в игру. Изначально у А $1$ грамм золота, а у B - неограниченное количество.
Каждый раунд проходит следующим образом:



A выбирает и показывает $x$ - неотрицательное вещественное число, не превышающее количество золота, которым владеет A.

B выбирает или ВЗЯТЬ - тогда A отдает B $x$ граммов золота,

Или же B выбирает ДАТЬ - тогда B отдает A $x$ граммов золота.


Всего B БЕРЕТ $n$ раз и ДАЕТ $n$ раз, затем игра заканчивается.

Определим $g(X)$ как наименьшее значение $n$, при котором в конце игры A будет гарантированно владеть не меньше, чем $X$ граммами золота. Известно, что $g(1.7) = 10$.


Найдите $g(1.9999)$.

 Оригинал
'''