'''
Задача 68
Магическое пятиугольное кольцо

Рассмотрим следующее "магическое" треугольное кольцо, заполненное числами от 1 до 6, с суммой на каждой линии равной 9.



Проходя по направлению часовой стрелки, начав с группы с наименьшим внешним узлом (в данном примере: 4,3,2), каждое решение можно описать единственным образом. К примеру, вышеуказанное решение можно описать множеством: 4,3,2; 6,2,1; 5,1,3.
Существует возможность заполнить кольцо с четырьмя различными суммами на линиях: 9, 10, 11 и 12. Всего существует восемь решений.



СуммаМножество решений


94,2,3; 5,3,1; 6,1,2


94,3,2; 6,2,1; 5,1,3


102,3,5; 4,5,1; 6,1,3


102,5,3; 6,3,1; 4,1,5


111,4,6; 3,6,2; 5,2,4


111,6,4; 5,4,2; 3,2,6


121,5,6; 2,6,4; 3,4,5


121,6,5; 3,5,4; 2,4,6



Объединяя элементы каждой группы, можно образовать 9-тизначную строку. Максимальное значение такой строки для треугольного кольца составляет 432621513.
Используя числа от 1 до 10, в зависимости от расположения, можно образовать 16-тизначные и 17-тизначные строки. Каково максимальное значение 16-тизначной строки для "магического" пятиугольного кольца?




Оригинал
'''