'''
Задача 81
Сумма пути: два направления

В представленной ниже матрице 5 на 5 путь с минимальной суммой при движении из верхнего левого угла в нижний правый (шагами только либо направо, либо вниз) выделен красным жирным шрифтом. Его сумма равна 2427.

$$
\begin{pmatrix}
\color{red}{131} & 673 & 234 & 103 & 18\\
\color{red}{201} & \color{red}{96} & \color{red}{342} & 965 & 150\\
630 & 803 & \color{red}{746} & \color{red}{422} & 111\\
537 & 699 & 497 & \color{red}{121} & 956\\
805 & 732 & 524 & \color{red}{37} & \color{red}{331}
\end{pmatrix}
$$

Найдите сумму наименьшего пути, взяв матрицу 80 на 80 из текстового файла matrix.txt (щелкнув правой кнопкой мыши, выберите 'Save Link/Target As...') размером 31KБ, двигаясь шагами (либо направо, либо вниз) из верхнего левого угла в нижний правый.
 Оригинал
'''