'''
Задача 259
Достижимые числа

натуральное число называется достижимым, если его можно получить из арифметического выражения согласно следующим правилам:

Использование цифр от 1 до 9 именно в таком порядке, каждую цифру использовать лишь один раз.
Любые последовательные цифры можно объединить (например, объединив цифры 2, 3 и 4, получим число 234).
Разрешены только четыре обычные двоичные арифметические действия (сложение, вычитание, умножение и деление).
Каждую из операций можно использовать сколько угодно раз, или не использовать вовсе.
Унарный минус не разрешается.
Разрешено любое количество скобок (допускаются вложенные) для указания последовательности выполнения операций.

К примеру, 42 является достижимым числом, т.к. (1/23) * ((4*5)-6) * (78-9) = 42.
Чему равна сумма всех положительных достижимых целых чисел?
 Оригинал
'''