'''
Задача 701
Случайно соединенная площадь


Рассмотрим прямоугольник, составленный из $W \times H$ квадратных ячеек, каждая с площадью 1.
Каждая ячейка независимо от остальных раскрашивается в черный цвет с вероятностью 0.5, в противном случае она остается белой. Черные ячейки, имеющие общую сторону, считаются соединенными.
Рассмотрим максимальную площадь соединенных ячеек.

Определим $E(W,H)$ как ожидаемое значение максимальной площади соединенных ячеек.
Например, $E(2,2)=1.875$, как показано ниже.





Известно также, что $E(4, 4) = 5.76487732$, округленное до 8 знаков после десятичной точки.


Найдите $E(7, 7)$, округленное до 8 знаков после десятичной точки.

 Оригинал
'''