'''
Задача 137
Золотые слитки Фибоначчи

Рассмотрим бесконечный полиномиальный ряд AF(x) = xF1 + x2F2 + x3F3 + ..., где Fk - k-й член последовательности Фибоначчи: 1, 1, 2, 3, 5, 8, ..., т.е. Fk = Fk−1 + Fk, F1 = 1 и F2 = 1.
В данной задаче нас интересуют такие значения x, при которых AF(x) является натуральным числом.


Удивительно, но AF(1/2)
 = 
(1/2)×1 + (1/2)2×1 + (1/2)3×2 + (1/2)4×3 + (1/2)5×5 + ...


 
 = 
1/2 + 1/4 + 2/8 + 3/16 + 5/32 + ...


 
 = 
2


Соответствующие значения x для первых пяти натуральных чисел приведены в таблице

ниже.



xAF(x)


√2−11


1/22


(√13−2)/33


(√89−5)/84


(√34−3)/55



Если x - рациональное число, то будем называть AF(x) золотым слитком, т.к. такие значения встречаются все реже и реже. Так, например, 10-й золотой слиток равен 74049690.
Найдите 15-й золотой слиток.
 Оригинал
'''