'''
Задача 814
Меццо-форте


$4n$ человек стоят в кругу с опущенными головами. При звонке колокольчика они все поднимают голову и смотрят или на стоящего непосредственно слева от себя, или на стоящего непосредственно справа от себя, или же на стоящего диаметрально напротив от себя. Если двое обнаруживают, что смотрят друг на друга, они оба начинают кричать.

Определим $S(n)$ как количество случаев, в которых кричит ровно половина людей. Известно, что $S(1) =  48$ и $S(10) \equiv 420121075 \mod{998244353}$.

Найдите $S(10^3)$. В качестве ответа приведите остаток от деления полученного результата на $998244353$.
 Оригинал
'''