'''
Задача 687
Перетасовывание карт

Стандартная колода карт, состоящая из 52 карт 13 достоинств (туз, двойка, ..., десятка, валет, дама, король) четырех мастей (трефы, бубны, червы и пики), случайным образом перетасовывается. Назовем достоинство идеальным, если после перетасовки никакие две карты этой масти не расположены в колоде друг за другом.

Можно заметить, что ожидаемое количество идеальных достоинств после случайной перетасовки равно $\frac {4324} {425} \approx 10.1741176471$.

Найдите вероятность того, что количество идеальных достоинств - простое число. Приведите ваш ответ округленным до 10 знака после десятичной точки.
 Оригинал
'''