'''
Задача 788
Доминирующие числа


Доминирующее число - это положительное целое число, более чем половина цифр которого одинаковы.


Например, $2022$ - доминирующее число, так как три из его четырех цифр являются $2$. Однако $2021$ не является доминирующим числом.


Пусть $D(N)$ будет количеством доминирующих чисел меньше $10^N$.
Например, $D(4) = 603$ и $D(10) = 21893256$.


Найдите $D(2022)$. В качестве ответа приведите остаток от деления полученного результата на $1\,000\,000\,007$.

 Оригинал
'''