'''
Задача 229
Четыре представления через квадраты

Рассмотрим число 3600. Оно очень особенное, потому что

3600 = 482 +     362

3600 = 202 + 2×402
3600 = 302 + 3×302
3600 = 452 + 7×152

Аналогично, мы обнаруживаем, что 88201 = 992 + 2802 = 2872 + 2×542 = 2832 + 3×522 = 1972 + 7×842.
В 1747 г. Эйлер доказал, какие числа можно представить в виде суммы двух квадратов. Нас интересуют числа n, которые отвечают следующим представлениям всех четырех видов:

n = a12 +   b12
n = a22 + 2 b22
n = a32 + 3 b32
n = a72 + 7 b72,

где ak и bk - натуральные числа.
Существует всего 75373 таких чисел, не превышающих 107.

Сколько существует таких чисел, не превышающих 2×109?
 Оригинал
'''