'''
Задача 83
Сумма пути: четыре направления

Примечание: Данная задача является намного более сложной версией 81-й задачи.
В представленной ниже матрице 5 на 5 путь с минимальной суммой из верхнего левого угла в нижний правый, при передвижении шагами вверх, вниз, вправо или влево, выделен красным жирным шрифтом. Его сумма равна 2297.

$$
\begin{pmatrix}
\color{red}{131} & 673 & \color{red}{234} & \color{red}{103} & \color{red}{18}\\
\color{red}{201} & \color{red}{96} & \color{red}{342} & 965 & \color{red}{150}\\
630 & 803 & 746 & \color{red}{422} & \color{red}{111}\\
537 & 699 & 497 & \color{red}{121} & 956\\
805 & 732 & 524 & \color{red}{37} & \color{red}{331}
\end{pmatrix}
$$

Найдите сумму наименьшего пути, взяв матрицу 80 на 80 из текстового файла matrix.txt (щелкнув правой кнопкой мыши, выберите 'Save Link/Target As...') размером 31KБ, передвигаясь шагами в любых направлениях (вверх, вниз, вправо, влево) из верхнего левого угла в нижний правый.
 Оригинал
'''