'''
Задача 799
Пятиугольная головоломка


Пятиугольные числа генерируются формулой $P_n = \tfrac 12n(3n-1)$, что создает следующую последовательность:

$$1,5,12,22,35,51,70,92,\ldots $$

Некоторые пятиугольные числа можно выразить как сумму двух других пятиугольных чисел.
Например:

$$P_8 = 92 = 22 + 70 = P_4 + P_7$$

3577 - наименьшее пятиугольное число, которое можно выразить как сумму двух пятиугольных чисел двумя разными способами

$$
\begin{align}
P_{49} = 3577 & = 3432 + 145 = P_{48} + P_{10} \\
 & = 3290 + 287 = P_{47}+P_{14}
\end{align}
$$

107602 - наименьшее пятиугольное число, которое можно выразить как сумму двух пятиугольных чисел тремя разными способами.


Найдите наименьшее пятиугольное число, которое можно выразить как сумму двух пятиугольных чисел не менее чем 100 разными способами.

 Оригинал
'''