'''
Задача 772
Раффовы числа


Пусть $S_k$ будет множеством, содержащим 2, 5 и первые $k$ простых чисел, заканчивающихся на цифру 7. Например, $S_3 = \{2,5,7,17,37\}$.

Определим $k$-раффово число как такое число, которое не делится ни на один элемент $S_k$.

Если $N_k$ является произведением элементов $S_k$, определим $F(k)$ как сумму всех $k$-раффовых чисел меньше $N_k$, последней цифрой которых является 7. Известно, что $F(3) = 76101452$.

Найдите $F(97)$. В качестве ответа приведите остаток от деления полученного результата на $1\,000\,000\,007$.
 Оригинал
'''