'''
Задача 245
Соупругость

Назовем дробь, которую невозможно сократить, упругой дробью. Далее, определим упругость знаменателя R(d) как отношение количества упругих правильных дробей к общему количеству правильных дробей с этим знаменателем. К примеру, R(12) = 4⁄11.



Упругость числа d > 1 равна
φ(d)d − 1
, где φ - функция Эйлера.




Далее определим соупругость числа n > 1 как C(n)= 
n − φ(n)n − 1.


Соупругость простого числа p равна C(p)
= 
1p − 1.



Найдите сумму всех сложных целых чисел 1 < n ≤ 2×1011, для которых C(n) - единичная дробь.


 Примечание: верхняя граница была изменена. Убедитесь, что вы используете верную верхнюю границу.
 Оригинал
'''