'''
Задача 449
Шоколадная конфета

Кондитер Фил готовит новую партию шоколадных конфет. Середина каждой конфеты имеет форму эллипсоида вращения, описанного уравнением: b2x2 + b2y2 + a2z2 = a2b2.


Фил хочет знать, сколько шоколада необходимо, чтобы покрыть середину одной конфеты равномерным слоем толщиной в один миллиметр.

Если a = 1 мм и b = 1 мм, необходимое количество шоколада равно 
    

28
3


π мм3.

Если a = 2 мм и b = 1 мм, необходимое количество шоколада примерно равно 60.35475635 мм3.


Найдите количество шоколада в мм3, необходимое, если a = 3 мм и b = 1 мм. Дайте ответ в виде числа, округленного до 8 знака после десятичной точки.
 Оригинал
'''