'''
Задача 417
Обратные циклы 2
Единичная дробь имеет 1 в числителе. Десятичные представления единичных дробей со знаменателями от 2 до 10 даны ниже:1/2= 0.51/3= 0.(3)1/4= 0.251/5= 0.21/6= 0.1(6)1/7= 0.(142857)1/8= 0.1251/9= 0.(1)1/10= 0.1Где 0.1(6) значит 0.166666..., и имеет повторяющуюся последовательность из одной цифры. Видно, что 1/7 имеет повторяющуюся последовательность из 6 цифр.

Считается, что единичные дроби, чей знаменатель не имеет иных простых множителей, кроме 2 и/или 5, не содержат повторяющуюся последовательность.
Определим длину повторяющейся последовательности таких единичных дробей равной 0.


Пусть L(n) будет обозначать длину повторяющейся последовательности в 1/n.
Известно, что ∑L(n) для 3 ≤ n ≤ 1 000 000 равно 55535191115.


Найдите ∑L(n) для 3 ≤ n ≤ 100 000 000


 Оригинал
'''