'''
Задача 420
Положительная целая матрица 2х2

Положительная целая матрица - это матрица, все элементы которой являются натуральными числами.
Некоторые натуральные матрицы могут быть выражены как квадрат натуральной матрицы двумя разными способами. К примеру:




Определим F(N) как количество натуральных матриц 2х2, имеющих след меньше N, и которые могут быть выражены как квадрат натуральной матрицы двумя разными способами.
Можно показать, что F(50) = 7 и F(1000) = 1019.


Найдите F(107).

 Оригинал
'''