'''
Задача 727
Треугольник из дуг окружностей

Пусть $r_a$, $r_b$ и $r_c$ будут радиусами трех окружностей, которые взаимно внешне касаются друг друга. Эти три окружности образуют между точками касания треугольник из дуг окружностей, как показано для трех синих окружностей на изображении ниже.





Определим описанную окружность этого треугольника как красную окружность с центром в $D$, проходящую через точки касания. Далее, определим вписанную окружность треугольника как зеленую окружность с центром в $E$, взаимно внешне касающуюся всех трех синих окружностей. Пусть $d=\vert DE \vert$ будет расстоянием между центрами описанной и вписанной окружностей.

Пусть $\mathbb{E}(d)$ будет ожидаемым значением $d$, когда $r_a$, $r_b$ и $r_c$ являются целыми числами, выбранными равномерно, так что $1\leq r_a<r_b<r_c \leq 100$ и $\text{gcd}(r_a,r_b,r_c)=1$.

Найдите $\mathbb{E}(d)$ и округлите до восьмого знака после десятичной точки.
 Оригинал
'''