'''
Задача 110
Обратные числа Диофанта 2

В представленном ниже равенстве x, y и n являются натуральными числами.



1x
 + 
1y
 = 
1n



При n = 4 существуют ровно три различных решения:



15
 + 
120
 = 
14


16
 + 
112
 = 
14


18
 + 
18
 = 
14



Нетрудно убедиться в том, что при n = 1260 существует 113 различных решений, и это значение n является наименьшим, при котором общее число решений превышает одну сотню.
Чему равно наименьшее значение n, при котором число различных решений превышает четыре миллиона?
Примечание: Данная задача намного сложнее 108-й задачи, и, поскольку для прямого подбора требуются куда большие вычислительные возможности, чем существуют на сегодняшний день, необходима грамотная реализация решения.
 Оригинал
'''