'''
Задача 275
Сбалансированные скульптуры

Определим сбалансированную скульптуру порядка n следующим образом:

Полимино состоит из n+1 плитки, которые называются блоками (n плиток) и основой (оставшаяся плитка);
центр основы имеет координаты (x = 0, y = 0);
y-координаты блоков больше нуля (таким образом, основа является единственной плиткой, расположенной ниже остальных);
центр масс объединения всех блоков, имеет x-координату равную 0.

Подсчитывая число скульптур, все построения, являющиеся отражениями относительно оси y, не считаются отличающимися. К примеру, 18 сбалансированных скульптур 6-го порядка показаны ниже. Обратите внимание, что каждая зеркальная пара изображений (относительно оси y) считается одной скульптурой:

Существует 964 сбалансированные скульптуры 10-го порядка, и 360505 скульптуры 15-го порядка.Найдите число сбалансированных скульптур 18-го порядка?
 Оригинал
'''