'''
Задача 679
Freefarea

Пусть $S$ будет множеством, состоящим из четырех букв $\{\texttt{`A'},\texttt{`E'},\texttt{`F'},\texttt{`R'}\}$.
Для $n\ge 0$ пусть $S^*(n)$ обозначает множество слов длиной $n$, составленных из букв множества $S$.
Обозначим слова $\texttt{FREE}, \texttt{FARE}, \texttt{AREA}, \texttt{REEF}$ как ключевые слова.
Пусть $f(n)$ будет количеством слов в $S^*(n)$, которые содержат все четыре ключевых слова, каждое - ровно один раз.
Это впервые происходит для $n=9$, и действительно, существует уникальное 9-буквенное слово, содержащее каждое ключевое слово однажды: $\texttt{FREEFAREA}$
Таким образом, $f(9)=1$.
Известно также, что $f(15)=72863$.
Найдите $f(30)$.
 Оригинал
'''