'''
Задача 264
Центры треугольников

Рассмотрим треугольники, обладающие следующими свойствами:

Все их вершины лежат в узлах сетки.
Центр описанной окружности находится в начале координат O.
Точка пересечения трех высот находится в точке H(5, 0).

Существует девять таких треугольников, периvетр которых ≤ 50.
Эти треугольники перечислены и показаны в порядке убывания их периметров:


A(-4, 3), B(5, 0), C(4, -3)
A(4, 3), B(5, 0), C(-4, -3)
A(-3, 4), B(5, 0), C(3, -4)
A(3, 4), B(5, 0), C(-3, -4)
A(0, 5), B(5, 0), C(0, -5)
A(1, 8), B(8, -1), C(-4, -7)
A(8, 1), B(1, -8), C(-4, 7)
A(2, 9), B(9, -2), C(-6, -7)
A(9, 2), B(2, -9), C(-6, 7)



Сумма всех их периметров, округленная до четвертого знака после десятичной точки, равна 291?0089.
Найдите все такие треугольники, периметр которых ≤ 105.
В качестве ответа, введите полученную сумму, округленную до четвертого знака после десятичной точки.
 Оригинал
'''