'''
Задача 615
Миллионное число с не меньше миллиона простых множителей


Рассмотрим натуральные числа, имеющие не меньше 5 простых множителей, не обязательно различных.
Расположив эти числа в порядке возрастания, получим список, начинающийся с:


32 = 2·2·2·2·2
48 = 2·2·2·2·3
64 = 2·2·2·2·2·2
72 = 2·2·2·3·3
80 = 2·2·2·2·5
96 = 2·2·2·2·2·3
 ...
Итак, например, пятое число с не меньше пяти простых множителей, равно 80.


Найдите миллионное число с не меньше миллиона простых множителей.
В качестве ответа приведите остаток от деления полученного числа на 123454321.

 Оригинал
'''