'''
Задача 82
Сумма пути: три направления

Примечание: Данная задача является более сложной версией 81-й задачи.
В представленной ниже матрице 5 на 5 путь от любого элемента левого столбца до любого элемента правого столбца, при передвижении шагами вверх, вниз и вправо, с минимальной суммой выделен красным жирным шрифтом. Его сумма равна 994.

$$
\begin{pmatrix}
131 & 673 & \color{red}{234} & \color{red}{103} & \color{red}{18}\\
\color{red}{201} & \color{red}{96} & \color{red}{342} & 965 & 150\\
630 & 803 & 746 & 422 & 111\\
537 & 699 & 497 & 121 & 956\\
805 & 732 & 524 & 37 & 331
\end{pmatrix}
$$

Найдите сумму наименьшего пути, взяв матрицу 80 на 80 из текстового файла matrix.txt (щелкнув правой кнопкой мыши, выберите 'Save Link/Target As...') размером 31KБ, двигаясь шагами (вверх, вниз, вправо) от левого столбца к правому стобцу.
 Оригинал
'''