'''
Задача 108
Обратные числа Диофанта 1

В представленном ниже равенстве x, y и n являются натуральными числами.



1x
 + 
1y
 = 
1n



При n = 4 существуют ровно три различных решения:



15
 + 
120
 = 
14


16
 + 
112
 = 
14


18
 + 
18
 = 
14



Каково наименьшее значение n, при котором число различных решений превышает одну тысячу?
Примечание: Данная задача является более простым вариантом 110-й задачи. Перед тем, как браться за нее, настоятельно рекомендуем Вам решить данную задачу.
 Оригинал
'''