'''
Задача 700
Эйлеркоин

Леонард Эйлер родился 15 апреля 1707 г.
Рассмотрим последовательность 1504170715041707n mod 4503599627370517.
Элемент этой последовательности считается Эйлеркоином, если он строго меньше всех ранее найденных Эйлеркоинов.
Например, первым элементом последовательности является 1504170715041707, он же является первым Эйлеркоином. Второй элемент последовательности - 3008341430083414, что больше 1504170715041707 и потому не является Эйлеркоином. Однако, третий элемент - 8912517754604, что достаточно мало, чтобы стать новым Эйлеркоином.
Таким образом, сумма первых двух Эйлеркоинов равна 1513083232796311.
Найдите сумму всех Эйлеркоинов.
 Оригинал
'''