'''
Задача 706
3-подобные числа


Для натурального числа $n$ определим $f(n)$ как количество непустых подстрок числа $n$, которые делятся на 3. Например, строка "2573" имеет 10 непустых подстрок, 3 из которых представляют числа, делящиеся на 3: 57, 573 и 3. Таким образом, $f(2573) = 3$.


Если $f(n)$ делится на 3, назовем число $n$ 3-подобным.


Определим $F(d)$ как количество 3-подобных $d$-значных чисел. Например, $F(2) = 30$ и $F(6) = 290898$.


Найдите $F(10^5)$. В качестве ответа приведите остаток от деления полученного результата на $1\,000\,000\,007$.

 Оригинал
'''