'''
Задача 292
Пифагоровы многоугольники

Определим Пифагоров многоугольник как выпуклый многоульник, обладающий следующими свойствами:

у него по крайней мере три вершины,
никакие из трех вершин не лежат на одной прямой,
координаты каждой из вершин - целые числа,
длина каждой из сторон - целое число.
Для заданного целого значения n определим P(n), как количество отличающихся Пифагоровых многоугольников,
периметры которых не превышают n.
Пифагоровы многоугольники могут рассматриваться как отличающиеся, если один не возможно получить переносом другого на координатной плоскости.
Известно, что P(4) = 1, P(30) = 3655 и P(60) = 891045.
Найдите P(120).
 Оригинал
'''